{"data":{"id":"1","name":"Staying aware of job-relevant news","description":"Keeping up-to-date on news that might inform decisions you make at work.","tags":[{"id":"6","name":"learning"},{"id":"7","name":"planning"}],"recommendations":[{"id":"99","markdown":"Decision makers—tech leads, senior and staff engineers, managers, directors—need to be aware of current events in their fields in order to make calls about what technologies the company should use, understand shifts in industry opinion, and tackle emergency situations.","facet_id":"1"},{"id":"100","markdown":"Do you have a routine for staying up-to-date with news that is relevant to the decisions you need to make in your job? Someone who is an expert at this skill shares interesting articles on chat, and is often the first to know about new tech.","facet_id":"2"},{"id":"101","markdown":"Staying up-to-date on news is all about building a habit. [Atomic Habits](https://jamesclear.com/atomic-habits) is a book that describes practical ways of incorporating new habits into your existing routines.","facet_id":"3"},{"id":"103","markdown":"The skill of staying up-to-date is something that needs to be part of a routine that happens at least a few times a week. The opportunities to use the awareness you gain from the habit come up spontaneously, and you can make a point to start conversations about the news with your colleagues whenever you want.","facet_id":"4"},{"id":"102","markdown":"When discussing technology or process decisions with colleagues, share links to relevant news items that they can read. Then you'll have a common baseline of shared information to support the discussion.","facet_id":"5"},{"id":"104","markdown":"Scan headlines on tech news aggregators. If there are lots of headlines about a similar topic, or if a topic is popular for several days or weeks at a time, it is worth learning enough about it to know whether you might need it for work decisions.","facet_id":"5"},{"id":"105","markdown":"Integrate checking news sites into an existing routine; for example, read the news while you drink your first coffee, or to unwind at the end of the workday.","facet_id":"5"},{"id":"106","markdown":"When a teammate shares an article with your work chat, give it a scan and participate in the conversation.","facet_id":"5"},{"id":"107","markdown":"[Hacker News](https://news.ycombinator.com/) is a popular aggregator for tech news, and there are conversations on each shared link where other technologists share their opinions.","facet_id":"5"}]}}