{"data":{"id":"10","name":"Using commitment language","description":"Making it obvious what you have committed to and when you will deliver on your commitment.","tags":[{"id":"1","name":"communication"},{"id":"10","name":"culture"},{"id":"2","name":"leadership"},{"id":"7","name":"planning"},{"id":"9","name":"teamwork"},{"id":"8","name":"time management"}],"recommendations":[{"id":"108","markdown":"Anyone who collaborates with other people who need to make plans based on when their work is done needs to know how to communicate clearly what the others' expectations should be.","facet_id":"1"},{"id":"109","markdown":"Leaders should use commitment language with their teams to establish a culture where clear commitments are expected from colleagues.","facet_id":"1"},{"id":"110","markdown":"Do you leave no room for uncertainty whenever you tell others what and when they can expect something from you? Someone who is an expert at this skill notices when they are leaving things open to interpretation and then makes sure that others are 100% clear on what they're saying they'll do.","facet_id":"2"},{"id":"111","markdown":"The book Elastic Leadership covers commitment language in [Chapter 6](https://livebook.manning.com/book/elastic-leadership/chapter-6/).","facet_id":"3"},{"id":"154","markdown":"The blog [Startup Culture: Deblurring Your Language](https://johnnyisji.medium.com/startup-culture-deblurring-your-language-c6a7e85f62ec) illustrates examples of imprecise commitments, their consequences, and steps to improve.","facet_id":"3"},{"id":"112","markdown":"When someone asks for you to do something for them, unambiguously tell them what they can expect from you and by when, or tell them why you can't commit right now and when you will tell them whether you can commit.","facet_id":"4"},{"id":"113","markdown":"When you offer to do something for someone, make sure they know exactly what you're offering to do and when they can expect you to complete it by.","facet_id":"4"},{"id":"114","markdown":"Request unambiguous commitments from others in order to set up a reciprocal relationship of using commitment language. If someone tells you that they'll do something in a non-committal way (for example, \"I should be able to do this by the end of the week,\") seek clarity on what they will do by their committed deadline.","facet_id":"5"}]}}