{"data":{"id":"12","name":"Interpreting laws and industry guidelines","description":"Being able to extract actionable information from laws and guidelines relevant to your work.","tags":[{"id":"3","name":"inclusion"}],"recommendations":[{"id":"2","markdown":"Anyone who works with sensitive data (confidential or personally identifiable information) needs to be aware of the legal ramifications if it is mishandled, and know when to seek specific advice.","facet_id":"1"},{"id":"3","markdown":"Leaders at businesses that create anything for use by the public need to know about laws pertaining to the accessibility of their product.","facet_id":"1"},{"id":"4","markdown":"Can you briefly explain each of the laws that affect decisions you make while building technology? Someone who is proficient in this skill can explain the privacy, accessibility, and other laws that apply to the technology that they write in the jurisdictions that govern it. These explanations can be at a high level and in plain language. They include which parts of each law are relevant to which parts of the technology.","facet_id":"2"},{"id":"5","markdown":"Several notable laws apply to many technology projects. Non-compliance could result in fines for your company.\n\n- The [GDPR](https://gdpr.eu/) protects the personal information of people in Europe, which your technology might collect.\n- [HIPAA](https://www.hhs.gov/hipaa/index.html) protects health information of people in the USA.\n- The [CAN-SPAM Act](https://www.ftc.gov/business-guidance/resources/can-spam-act-compliance-guide-business) protects citizens from spam communications in the USA.\n- [CASL](https://crtc.gc.ca/eng/internet/anti.htm) is Canada's anti-spam legislation.\n- [PIPEDA](https://www.priv.gc.ca/en/privacy-topics/privacy-laws-in-canada/the-personal-information-protection-and-electronic-documents-act-pipeda/) protects the personal information of citizens in Canada.","facet_id":"3"},{"id":"6","markdown":"If your business handles payment card details, it needs to comply with the [Payment Card Industry Data Security Standard](https://www.pcisecuritystandards.org/) (PCI compliance).","facet_id":"3"},{"id":"7","markdown":"SaaS companies often seek to be compliant with [SOC 2](https://us.aicpa.org/interestareas/frc/assuranceadvisoryservices/socforserviceorganizations). Both SOC 2 Types 1 and 2 require audits by external Certified Professional Accountants (CPA).","facet_id":"3"},{"id":"8","markdown":"If you do scientific research and experimental development in Canada, you may need to produce documents to apply for [SR&ED credits](https://www.canada.ca/en/revenue-agency/services/scientific-research-experimental-development-tax-incentive-program.html).","facet_id":"3"},{"id":"9","markdown":"When collecting user information, take the time to question whether the information is personally identifiable by itself or in combination with other data. If so, there will be measures required to protect this data in compliance with relevant laws.","facet_id":"4"},{"id":"10","markdown":"When sending communications to users of a technology via email, SMS, or other means, there may be laws requiring features such as the ability to unsubscribe from future messages of the same kind.","facet_id":"4"},{"id":"11","markdown":"Talk to the legal expert in your company to understand what standards your technology is required to be compliant with.","facet_id":"5"},{"id":"12","markdown":"Talk to the technical leadership in your company about any compliance initiatives they are working on.","facet_id":"5"},{"id":"13","markdown":"Read the Terms of Use, End User License Agreement, or Privacy Policy of the software you are building.","facet_id":"5"}]}}