{"data":{"id":"13","name":"Celebrating wins","description":"Appropriately sharing appreciation for the good work of individuals and teams.","tags":[{"id":"2","name":"leadership"},{"id":"9","name":"teamwork"}],"recommendations":[{"id":"32","markdown":"Anyone working on a team needs to establish strong, supportive relationships to be happy at work and to be as productive as possible. Celebrating wins helps everyone on the team understand each other's values, and reinforces positive feelings for good work outcomes.","facet_id":"1"},{"id":"33","markdown":"Leaders especially need to be aware of the oversized impact that it makes when they celebrate others' good ideas.","facet_id":"1"},{"id":"34","markdown":"Do you find something to celebrate about your team's achievements every week? How about every day? It can be as simple as chiming in with \"Nice one!\" when someone shares a good idea over chat or in a meeting.","facet_id":"2"},{"id":"35","markdown":"Does your team know when they've made an impression on you for their good work? It might not look like people are taking your celebrations to heart, but trust that they hear you. If you ask them in one-on-one meetings if they think the team celebrates enough for their wins, it'll give a clear signal.","facet_id":"2"},{"id":"36","markdown":"The notorious book [How to Win Friends and Influence People](https://en.wikipedia.org/wiki/How_to_Win_Friends_and_Influence_People) gives numerous strategies for how to approach praising others, and helps you understand the effect that doing so has.","facet_id":"3"},{"id":"37","markdown":"In meetings where many people are contributing ideas, when someone proposes an idea that you like, let the group know. Point out what the virtues of the idea are.","facet_id":"4"},{"id":"38","markdown":"Project milestones, sprint goals achieved, and other deadlines that are met are worth celebrating. Point out when estimations were correct.","facet_id":"4"},{"id":"39","markdown":"When celebrating someone else's achievement, pay attention to their response. Some people prefer more or less praise, or for praise to be more or less public. If you notice that someone prefers a specific kind of celebration, note it down, and be considerate of their preference in the future.","facet_id":"5"}]}}