{"data":{"id":"15","name":"Giving structured feedback","description":"Providing timely, constructive guidance to teammates in a way that clearly communicates situations, actions, and outcomes.","tags":[{"id":"1","name":"communication"},{"id":"10","name":"culture"},{"id":"2","name":"leadership"},{"id":"9","name":"teamwork"}],"recommendations":[{"id":"63","markdown":"Anyone working on a long-term team will benefit from establishing a culture of feedback so that the whole team can help each other grow as they work.","facet_id":"1"},{"id":"64","markdown":"How often do you provide feedback to coworkers in an empathetic way? How long do you wait between observing something and providing feedback on it? Someone who is exceptional at providing feedback will give it quickly and directly, while treating the recipient with respect and understanding.","facet_id":"2"},{"id":"65","markdown":"[The experience cube](https://coachingleaders.co.uk/the-experience-cube-explained-in-a-page/) is one method of giving structured feedback focused on the experience of the one giving the feedback.","facet_id":"3"},{"id":"66","markdown":"The book [Radical Candor](https://www.radicalcandor.com/the-book/) goes over how to build a culture based on guidance that is given while genuinely caring about the person receiving the feedback while also challenging them directly.","facet_id":"3"},{"id":"69","markdown":"Giving and receiving feedback should be a regular part of everyday work. In addition to giving feedback to others, request feedback from team members to establish a culture of feedback.","facet_id":"4"},{"id":"67","markdown":"When you observe yourself having an emotional reaction to something that you observed in another's actions, write down your observations. Then you can prepare to deliver those observations as feedback when the person would be most receptive to hearing about how their action was received by you.","facet_id":"5"},{"id":"68","markdown":"Practice giving feedback to the people who you are most comfortable with, and ask them for feedback about your feedback.","facet_id":"5"}]}}