{"data":{"id":"17","name":"Running effective meetings","description":"Keeping meetings on track and ensuring good outcomes.","tags":[{"id":"3","name":"inclusion"},{"id":"2","name":"leadership"},{"id":"7","name":"planning"},{"id":"8","name":"time management"}],"recommendations":[{"id":"91","markdown":"Anyone who has been called on to host, chair, scribe, or moderate a meeting, or has called a meeting with other people needs to have skills to ensure that the meeting is valuable to participants.","facet_id":"1"},{"id":"92","markdown":"Do you follow clearly defined, well understood rules when chairing meetings? When someone like this is running a meeting, things go smoothly because everyone is aware of expectations of themselves and each other.","facet_id":"2"},{"id":"93","markdown":"Do you ensure that meeting participants are aware of everything they need to know before coming to a meeting to provide and receive as much value as possible from meetings you host? Someone who excels at this can look at the predefined agendas for meetings they ran and the notes taken during the meeting and find strong correlation between the two. ","facet_id":"2"},{"id":"94","markdown":"[Robert's Rules of Order](https://robertsrules.com/books/newly-revised-3rd-in-brief-edition/) is a classic that describes tools needed to run effective meetings.","facet_id":"3"},{"id":"95","markdown":"Atlassian has a website dedicated to [Team Playbooks](https://www.atlassian.com/team-playbook), which are step-by-step guides for how to run meetings for specific purposes.","facet_id":"3"},{"id":"145","markdown":"Slack has an article with practical strategies on [How to run effective virtual and in-person meetings](https://slack.com/intl/en-gb/blog/productivity/run-effective-meetings).","facet_id":"3"},{"id":"97","markdown":"Surprisingly, one of the hardest parts of using this skill happens before the meeting has even started. Setting expectations, creating agendas, and making sure participants are prepared are as important as keeping things on track during the meeting itself.","facet_id":"4"},{"id":"96","markdown":"If you aren't already using meeting rules or playbooks, every meeting you have, whether you're the chair or not, can be an opportunity to experiment with a new rule. Introducing rules slowly to a team is a good way to help people get accustomed to new rules and learn how to use them well.","facet_id":"5"},{"id":"98","markdown":"If there's a kind of meeting that you haven't tried before — anything from a lunch and learn to a pre-mortem — volunteer to set one up with your team to see whether it's a format that they value.","facet_id":"5"}]}}