{"data":{"id":"2","name":"Experimenting with technology","description":"Having strategies for approaching new tools and being comfortable getting your hands dirty.","tags":[{"id":"6","name":"learning"},{"id":"7","name":"planning"}],"recommendations":[{"id":"56","markdown":"When a team is deciding whether to use a new technology, every team member's opinion matters. Each team member should be capable of trying out the new technology themselves for the team to make the best decision.","facet_id":"1"},{"id":"57","markdown":"Technologists on teams who are asked to use new technologies for projects need to learn how to use them on the fly, and experimentation is a good way to do that.","facet_id":"1"},{"id":"58","markdown":"What is your strategy for trying out a technology you've never used before? If you can think of the first step you'd take if tasked with exploring some new tech, then you're well on your way.","facet_id":"2"},{"id":"59","markdown":"[TodoMVC](https://todomvc.com/) shows how to create simple, experimental to-do list applications with many popular technologies. Building the same app in many different technologies can be a great way to become quicker and more deliberate with your technology experimentation.","facet_id":"3"},{"id":"60","markdown":"While you're [staying up-to-date on tech news](https://tessa.commit.community/skills/1/), you might come across an emerging technology that sounds like it could be valuable to bring to your team for evaluation. Having a quick experiment that you've put together can help the team understand the value of the technology.","facet_id":"4"},{"id":"61","markdown":"Another team at your company that you're interested in joining or collaborating with, or a job that you've applied to, might be using a technology you've never tried. An experiment can help you gauge the learning curve of the technology.","facet_id":"4"},{"id":"62","markdown":"When creating experiments, it can be tempting to not follow best practices such as committing source code to version control, or organizing and naming files in a discoverable way. However, when you have dozens of experiments and you want to find some particular code you wrote, good naming and organization will save lots of time. Also, you don't want to lose your experiments if your computer dies or gets stolen; push them to a remote repository for safe keeping.","facet_id":"5"}]}}