{"data":{"id":"21","name":"Coaching","description":"Helping others develop their own capabilities through thoughtful prompting and direction.","tags":[{"id":"1","name":"communication"},{"id":"2","name":"leadership"}],"recommendations":[{"id":"148","markdown":"Anyone can coach anyone else, but technical and people leaders most often find that there are expectations that they will coach their newer colleagues and direct reports.","facet_id":"1"},{"id":"149","markdown":"When someone comes to you for help because they're stuck, do default to instructing them on how to become unstuck, or do you ask them prompting questions to help them develop their capacity for unsticking themselves in the future? A good coach will do the latter.\n\nSomeone who is a good coach can tell when a person needs direct answers, and doesn't waste time if that's the case. They also know when a person is receptive to coaching, and keeps their advice to themselves in those cases, instead focusing on developing the person's problem solving skills.","facet_id":"2"},{"id":"150","markdown":"[The Coaching Habit](https://pagetwo.com/book/the-coaching-habit/) is a book that describes the kinds of questions a coach should be asking, and interactions they should be having.","facet_id":"3"},{"id":"151","markdown":"Anytime someone asks you for help, it might be an opportunity to coach, depending on the context and urgency of their request. It can be frustrating to someone asking for help if you ask them prompting questions instead of offering the information they need. A good rule of thumb is, if they help someone needs is advice, it might be a good opportunity to coach. If the help they need is because they're blocked due to missing information, then it's better to give them the information they need.","facet_id":"4"},{"id":"152","markdown":"Managers who have regular one-on-one meetings with their direct reports will find that these are idea opportunities for coaching.","facet_id":"4"},{"id":"153","markdown":"The next time you're brainstorming with someone, after they give an idea, try asking them for another idea before offering your own. Keep asking until they admit they're out of ideas. This gives them an opportunity to exercise their limits.","facet_id":"5"}]}}