{"data":{"id":"4","name":"Using plain language","description":"Communicating effectively with non-technical readers by avoiding jargon and structuring information simply.","tags":[{"id":"1","name":"communication"},{"id":"3","name":"inclusion"},{"id":"9","name":"teamwork"}],"recommendations":[{"id":"125","markdown":"Anyone in a technical job that needs to work with colleagues who do not share their technical expertise needs to be able to put technical concepts in plain terms in order to collaborate effectively.","facet_id":"1"},{"id":"126","markdown":"Anyone who speaks with or writes to people from outside of their team or organization needs to be able to discuss concepts using language that is accessible to them.","facet_id":"1"},{"id":"127","markdown":"Do you intentionally avoid using technical jargon when speaking with people who aren't likely to understand it? Someone who excels at this skill is in the habit of explaining the technologies they use in ways that non-technical people understand instead of using words that only other technologists are likely to know.","facet_id":"2"},{"id":"128","markdown":"Do you apply the principles of plain language in speaking and writing to more effectively communicate your ideas? Someone who does this spends less time clarifying what they meant after saying or writing something.","facet_id":"2"},{"id":"129","markdown":"The United States government has published a website with resources on plain language, [plainlanguage.gov](https://www.plainlanguage.gov/).","facet_id":"3"},{"id":"130","markdown":"Many conversations that technologists during work are with other technologists who share their expertise and understand their jargon. Technologists also write documentation that is exclusively for each other's use. These are situations where technical language is preferred, and even needed.","facet_id":"4"},{"id":"131","markdown":"Any recorded speaking or writing that might be made available to someone who is non-technical should use plain language, because it is unknown at the time of production what the technical level of the listener or reader will be.","facet_id":"4"},{"id":"132","markdown":"In discussions that include both technical and non-technical participants, it's valuable to use plain language so that the non-technical participants can collaborate more fully.","facet_id":"4"},{"id":"133","markdown":"Practice by reviewing a piece of writing you've previously written. This could be a chat message, a blog post, or anything you can think of that a non-technical reader may have accessed. Try to identify the words that the reader may not understand. Think about how you could break long sentences into several smaller sentences.","facet_id":"5"}]}}