{"data":{"id":"5","name":"Learning from mistakes","description":"Using mistakes as opportunities for learning and improvement.","tags":[{"id":"10","name":"culture"},{"id":"4","name":"humility"},{"id":"6","name":"learning"}],"recommendations":[{"id":"76","markdown":"Anyone who is reaching outside of their comfort zone, trying to expand their skills or learn a new technology, will make many mistakes while doing so, and needs to make the most of those learning opportunities.","facet_id":"1"},{"id":"77","markdown":"People in leadership positions should encourage a culture of learning from mistakes in a blameless way to promote a supportive and safe workplace. They can do this by being transparent about their mistakes and how they intend to learn from them.","facet_id":"1"},{"id":"78","markdown":"When something goes wrong at work, do you take intentional, structured steps to learn from the mistake, record and formally share your learnings? Someone who is an expert at this skill gets excited when they make a mistake because they're really looking forward to the learning that will come out of it.","facet_id":"2"},{"id":"79","markdown":"Before learning from a mistake, it's important to understand fundamentally what went wrong. There are numerous ways to analyze what the root cause of a problem was. [5 why's](https://en.wikipedia.org/wiki/Five_whys) is a popular method.","facet_id":"3"},{"id":"80","markdown":"Indeed.com has an article about [How to Learn From Your Mistakes](https://www.indeed.com/career-advice/career-development/learn-from-the-mistakes) which has a list of steps for making the most of mistakes.","facet_id":"3"},{"id":"81","markdown":"Having a blameless culture makes it much easier for everyone to learn from mistakes. Here's an article on the Bench Engineering blog that explains how to cultivate a [blameless culture](https://medium.com/bench-engineering/breaking-good-55fed1d81aac) when people make mistakes.","facet_id":"3"},{"id":"82","markdown":"Mistakes come in all shapes and sizes. There are opportunities to learn from programming errors that are caught in code review just as much as customer-affecting service degradation.","facet_id":"4"},{"id":"146","markdown":"When a mistake causes a service degradation or outage on a production software system, a root cause analysis or 5-Whys meeting is a way to learn from that mistake.","facet_id":"4"},{"id":"147","markdown":"Regular retrospectives are good opportunities to reflect on things that didn't go well, whether they were mistakes or not. Doing personal or team retrospectives on a regular cadence makes it so you never miss an opportunity to learn and make things better.","facet_id":"4"},{"id":"83","markdown":"You can't intentionally practice making mistakes. However, you can practice analyzing past mistakes. You can also prepare for how you intend to learn from future mistakes.\n\nTo practice analyzing past mistakes, start with documentation. Write down everything you can remember about the context and timeline surrounding the mistakes. After doing this several times, you may start to see patterns. Try to describe these patterns and how you might be able to identify them if they materialize in the future.\n\nTo prepare to learn from future mistakes, keep in mind what was most notable about the documentation you make about past mistakes. As soon as possible after you notice a new mistake, write down the important observations that you know will be relevant to making the most of the new mistake.","facet_id":"5"}]}}