{"data":{"id":"7","name":"Being customer-minded","description":"Considering the needs of your internal or external customers when making choices that affect them.","tags":[{"id":"4","name":"humility"},{"id":"3","name":"inclusion"},{"id":"7","name":"planning"}],"recommendations":[{"id":"25","markdown":"Anyone who produces technology needs to take into account the needs of its end users. As the creators of technology, we are responsible for the value that those users get from the technology, so they should be the drivers of the decisions we make.","facet_id":"1"},{"id":"26","markdown":"When deciding between options for implementing some technology, do you account for all the diversity in the user base for that technology? Diversity includes both the knowledge and beliefs of the individual users, and the technologies they use. For example, do you think through the variety of ways users will interact with interfaces? Even pointing devices vary from trackpads, mice, track points, and styluses to multi-touch screens. Do you think about how colours have different meanings in different cultures, and that some users aren't able to see the same colours as you and your testers?","facet_id":"2"},{"id":"27","markdown":"Do you think through the variation in the use cases that your customers have in their problems? Creating technology solutions that are too restrictive might mean some customers can't solve their problems.","facet_id":"2"},{"id":"28","markdown":"Microsoft has resources on [Inclusive Design](https://www.microsoft.com/design/inclusive/) which help technologists learn about how to think more inclusively about their users.","facet_id":"3"},{"id":"29","markdown":"The article [How To Write Good Error Messages](https://uxplanet.org/how-to-write-good-error-messages-858e4551cd4) is a good starting point to researching error message best practices.","facet_id":"3"},{"id":"30","markdown":"Choices that rely on an understanding of customer needs come up throughout the technology lifecycle.\n\n- Labels, colours, and imagery in user interfaces need to be broadly understood by the entire user base.\n- Customers may require some operations to be fast or synchronous, like confirmation of data being saved.\n- The wording of, and information in error messages are important to both users and the technical support people at your business.","facet_id":"4"},{"id":"31","markdown":"The next technology decision you make that requires an analysis of pros and cons, intensionally list the pros and cons from the customer perspective. If one option is faster than another, but requires more upfront effort to implement, does your customer know that the effort went into it? If customers are waiting for the feature, is it worthwhile to choose a slower implementation in order to release it sooner?","facet_id":"5"}]}}