{"data":{"id":"8","name":"Creating an ergonomic workstation","description":"Setting up your chair, work surface, and computer peripherals in a way that minimizes the harms from prolonged desk work.","tags":[{"id":"5","name":"health & well-being"}],"recommendations":[{"id":"40","markdown":"This skill is useful for anyone who works from a home or personal office and is responsible for provisioning and setting up their own equipment and office furniture. They need it to avoid injury and be as productive as possible.","facet_id":"1"},{"id":"41","markdown":"When you notice yourself feeling eye-strain, musculoskeletal discomfort, or acute joint pain, do you adjust your home office setup based on ergonomic principles and does it provide relief?","facet_id":"2"},{"id":"42","markdown":"After you take the time to set up your workspace properly, is the duration, severity, and frequency of discomfort you feel while working reduced?","facet_id":"2"},{"id":"43","markdown":"The [Ergonomics subreddit](https://www.reddit.com/r/Ergonomics/) shares resources for how to create more ergonomic spaces.","facet_id":"3"},{"id":"44","markdown":"Ask your team how they set up their desks. See if they're OK talking about discomfort they've had with desk setups in the past.","facet_id":"3"},{"id":"45","markdown":"After spending about an hour at your desk, think through each of the common issues that office workers suffer from and try to gauge whether you are also feeling those issues. Are your eyes tired? Do your wrists hurt? Are your feet or legs sore? Is your neck or back stiff?","facet_id":"4"},{"id":"46","markdown":"Move each part of your body. If any of them feel uncomfortable, stretch them thoroughly before getting back to work. If the stretching helped you feel relief, then try to get in the habit of doing so ever twenty minutes.","facet_id":"5"},{"id":"47","markdown":"Research the correct positioning and angles of your screen, keyboard, pointing device, other items on your desk that you interact with, and your chair. Adjust each of these based on your research and assess whether the new positioning makes you feel more comfortable while working.","facet_id":"5"},{"id":"48","markdown":"The 20-20-20 rule—every 20 minutes, focus your eyes on something 20 feet away for 20 seconds—can help reduce eye strain.","facet_id":"5"}]}}