{"data":{"id":"9","name":"Minimizing context switching","description":"Organizing your work environment to remove distractions, allowing for more focused, productive use of time.","tags":[{"id":"5","name":"health & well-being"},{"id":"7","name":"planning"},{"id":"8","name":"time management"}],"recommendations":[{"id":"84","markdown":"Anyone who is juggling multiple tasks needs to have the skills to organize their time in the most productive way.","facet_id":"1"},{"id":"85","markdown":"Are you able to time-box and manage your tasks effectively with minimal interruptions or distractions? Someone who is an expert at this skill thinks about when they're going to be working on each task, and has clear rules for when they're available to work with others or change what they're paying attention to.","facet_id":"2"},{"id":"86","markdown":"A discussion of the detrimental effects of context switching is discussed in the blog post [The Hidden Stress of Context Switching](https://front.com/blog/context-switching).","facet_id":"3"},{"id":"87","markdown":"The book [Deep Work](https://www.calnewport.com/books/deep-work/) gives guidance on how to build a habit of getting in the zone at work.","facet_id":"3"},{"id":"88","markdown":"Are there short tasks which can be \"time-boxed\"? Start with small tasks or tickets, and work up to larger ones (which can be split into smaller chunks).","facet_id":"4"},{"id":"89","markdown":"If you notice that some of your tasks should be worked on without interruption, it's a good time to lay down the ground rules for what constitutes \"interruptible time\" vs. \"non-interruptible time\".\n\nDuring \"interruptible time\", work on things that are not time sensitive, and you can afford to pause to write an email, text someone back, etc.. \n\nDuring \"non-interruptible\" time, work on tasks that should be time-boxed and distractions should be removed.","facet_id":"4"},{"id":"90","markdown":"Try giving yourself allotted periods of time where you are not to be interrupted. Turn off Slack, Mail, and any other program that has a push notification system built in.\n\nApple devices have Focus settings available as of iOS/iPadOS 15 and MacOS Monterey. You can set one device to Do Not Disturb or another specific Focus setting such as Work or Personal and it will be applied to all Apple devices.","facet_id":"5"}]}}